amqp/amqp-bak.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>amqp-bak</title>
<!-- 2017-11-16 Thu 13:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
</head>
<body>
<div id="content">
<h1 class="title">amqp-bak</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. AMQP Client</a>
<ul>
<li><a href="#sec-1-1">1.1. 核心接口</a></li>
<li><a href="#sec-1-2">1.2. 核心流程</a></li>
<li><a href="#sec-1-3">1.3. 并发相关</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Spring rabbit</a>
<ul>
<li><a href="#sec-2-1">2.1. 核心流程</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. SimpleMessageListenerContainer</a></li>
<li><a href="#sec-2-1-2">2.1.2. AsyncMessageProcessingConsumer</a></li>
<li><a href="#sec-2-1-3">2.1.3. BlockingQueueConsumer</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. 并发相关</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> AMQP Client</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 核心接口</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Channel

<p>
用于实现AMQP协议规定的动作
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">basicPublish</span>(<span style="color: #0287c8; font-weight: bold;">String</span> <span style="color: #4fa8a8;">exchange</span>, <span style="color: #0287c8; font-weight: bold;">String</span> <span style="color: #4fa8a8;">routingKey</span>, <span style="color: #0287c8; font-weight: bold;">BasicProperties</span> <span style="color: #4fa8a8;">props</span>, <span style="color: #0287c8; font-weight: bold;">byte</span>[] <span style="color: #4fa8a8;">body</span>) <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">IOException</span>;

<span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">basicAck</span>(<span style="color: #0287c8; font-weight: bold;">long</span> <span style="color: #4fa8a8;">deliveryTag</span>, <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #4fa8a8;">multiple</span>) <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">IOException</span>;
</pre>
</div>
</li>

<li>Connection

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0287c8; font-weight: bold;">Channel</span> <span style="color: #424242; font-weight: bold;">createChannel</span>() <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">IOException</span>;
</pre>
</div>
</li>

<li>ConnectionFactory

<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #0287c8; font-weight: bold;">Connection</span> <span style="color: #424242; font-weight: bold;">newConnection</span>(<span style="color: #0287c8; font-weight: bold;">ExecutorService</span> <span style="color: #4fa8a8;">executor</span>, <span style="color: #0287c8; font-weight: bold;">Address</span>[] <span style="color: #4fa8a8;">addrs</span>);
</pre>
</div>
</li>

<li>Consumer

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">handleDelivery</span>(<span style="color: #0287c8; font-weight: bold;">String</span> <span style="color: #4fa8a8;">consumerTag</span>, <span style="color: #0287c8; font-weight: bold;">Envelope</span> <span style="color: #4fa8a8;">envelope</span>, <span style="color: #989848; font-weight: bold;">AMQP</span>.<span style="color: #0287c8; font-weight: bold;">BasicProperties</span> <span style="color: #4fa8a8;">properties</span>, <span style="color: #0287c8; font-weight: bold;">byte</span>[] <span style="color: #4fa8a8;">body</span>) <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">IOException</span>;
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 核心流程</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
1. ConnectionFactory.newConnection().start();

    建立会话，并新建线程启动MainLoop

2. MainLoop.run()

    不停的从连接读数据，并将读到的数据封装到frame中，由ChannelManager.getChannel(frame.channel).handleFrame(frame)处理

3. ChannelN.processAsyn() 

    channel根据数据内容中的consumerTag找到对应的Consumer，然后把Consumer和消息一起传给ConsumerDispatcher

4. ConsumerDispatcher.handleDelivery(handleDelivery(final Consumer delegate,
                            final String consumerTag,
                            final Envelope envelope,
                            final AMQP.BasicProperties properties,
                            final byte[] body) throws IOException);

    ConsumerDispatcher将调用Consumer.onMessage()的代码封装成一个task，添加到待处理任务队列中。即: ConsumerDispatcher.workService.addWork(delegate.handleDelivery());
</pre>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 并发相关</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>取消息的逻辑在MainLoop中，是单线程操作。
</li>
<li>实际消费消息在ConsumerDispatcher中，会使用线程池。
</li>
<li>如果ConnectionFactory设置了sharedExecutor，则由该ConnectionFactory创建的所有连接共用sharedExecutor
</li>
<li>如果没有设置，则每个Connection会创建一个自己的FixedThreadPool 线程数为核心数*2
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Spring rabbit</h2>
<div class="outline-text-2" id="text-2">
<p>
spring-rabbit是spring对amqp-client的封装，主要是通过SimpleMessageListenerContainer
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 核心流程</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> SimpleMessageListenerContainer</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li>提供用户配置的接口，用户可以配置ConnectionFactory, concurrentConsumers, messageListener, taskExecutor等
</li>
<li>在doStart()方法中, 初始化AsyncMessageProcessingConsumer,并由taskExecutor执行其run方法
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> AsyncMessageProcessingConsumer</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
该类是一个任务封装类，实现了Runnable接口
</p>
<ol class="org-ol">
<li>在run方法中先调用BlockingQueueConsumer的start()方法完成连接创建和Consumer注册
</li>
<li>再循环调用doReceiveAndExecute方法
</li>
<li>recieve是通过BlockingQueueConsumer获取消息
</li>
<li>execute是回调MessageListener的onMessage方法
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> BlockingQueueConsumer</h4>
<div class="outline-text-4" id="text-2-1-3">
<ol class="org-ol">
<li>在start()方法中先创建MQ连接，并调用AMQConnection的start方法启动MainLoop
</li>
<li>再调用Channel.basicConsume()注册Consumer 即InternalConsumer
</li>
<li>InternalConsumer的handleDelivery方法将收到的消息放入BlockingQueueConsumer的队列中，供AsyncMessageProcessingConsumer使用
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 并发相关</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>spring-rabbit底层是amqp-client，所以ConsumerDispatcher使用的线程池不变。
</li>
<li>spring-rabbit提供了一个额外的属性concurrencyConsumers，可以设置每个队列的Consumer的数量

<p>
** Lord of the Rings
   My favorite scenes are (in this order)
</p>
<ol class="org-ol">
<li>The attack of the Rohirrim
</li>
<li>Eowyn's fight with the witch king
<ul class="org-ul">
<li>this was already my favorite scene in the book
</li>
<li>I really like Miranda Otto.
</li>
</ul>
</li>
<li>Peter Jackson being shot by Legolas
<ul class="org-ul">
<li>on DVD only
</li>
</ul>
<p>
He makes a really funny face when it happens.
</p>
</li>
</ol>
<p>
But in the end, no individual scenes matter but the film as a whole.
Important actors in this film are:
</p>
<dl class="org-dl">
<dt> Elijah Wood </dt><dd>He plays Frodo
</dd>
<dt> Sean Astin </dt><dd>He plays Sam, Frodo's friend.  I still remember
him very well from his role as Mikey Walsh in The Goonies.
</dd>
</dl>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-11-16 Thu 13:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>